Autodesk.Revit.DB.Structure.ComputationDataFor3DPathSet.GetPointToDeterminePositionFromPath
Gets a point on the path used to determine the position of the computation curves with respect to path.
This point is set and used by the server to react to the changes of the path edge.
Returns:
A point on the path used to determine the position of the computation curves with respect to path.
Since:
2027

Autodesk.Revit.DB.Structure.ComputationDataFor3DPathSet.GetTerminationPlaneNormal(System.Int32)
Gets the plane's normal in which the termination (e.g. hook, crank) at end of bar will stay.
end:
The end of bar. Should be 0 for start or 1 for end.
Returns:
Returns the plane's normal in which the termination (e.g. hook, crank) at end of bar will stay.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Invalid end.
Since:
2027

Autodesk.Revit.DB.Structure.ComputationDataFor3DPathSet.SetTerminationPlaneNormal(System.Int32,Autodesk.Revit.DB.XYZ)
Sets the plane's normal in which the termination (e.g. hook, crank) at end of bar will stay.
end:
The end of bar. Should be 0 for start or 1 for end.
terminationPlaneNormal:
The plane's normal in which the termination (e.g. hook, crank) at end of bar will stay.
The normal should be perpendicular to the bar direction at the specified end of bar.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Normal terminationPlaneNormal for end end isn't a valid normal for bar.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Invalid end.
-or-
terminationPlaneNormal has zero length.
Since:
2027

Autodesk.Revit.DB.Structure.ComputationDataFor3DPathSet.GetCurves
Gets the curves that define the 3D path set.
Returns:
The curves that define the 3D path set.
Since:
2027

Autodesk.Revit.DB.Structure.ComputationDataFor3DPathSet.CreateFromRebar(Autodesk.Revit.DB.Structure.Rebar,System.Int32)
Creates a new instance of the ComputationDataFor3DPathSet class from the provided Rebar element.
Remarks:
When setting the data from a rebar, the curves are extracted from the bar at index barPositionIndex.
The terminations in the 3D Path set will be oriented similarly to the terminations in the rebar.
rebar:
The rebar element from which the data will be obtained.
barPositionIndex:
The index of the bar. Should be a number between 0 and Rebar.NumberOfBarPositions - 1.
Returns:
Returns a new instance of the ComputationDataFor3DPathSet class.
Throws Autodesk.Revit.Exceptions.ArgumentException:
barPositionIndex should be a number between 0 and Rebar.NumberOfBarPositions - 1.
-or-
rebar should have coplanar curves.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.Structure.ComputationDataFor3DPathSet.CreateFromCurves(System.Collections.Generic.IList{Autodesk.Revit.DB.Curve})
Creates a new instance of the ComputationDataFor3DPathSet class from the provided curves.
curves:
The curves that define the 3D path set. The curves must be coplanar and continuous.
Returns:
Returns a new instance of the ComputationDataFor3DPathSet class.
Throws Autodesk.Revit.Exceptions.ArgumentException:
curves are not continuous. They do not form a valid curve loop.
-or-
The curves are not coplanar.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.Structure.ComputationDataFor3DPathSet.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.ComputationDataFor3DPathSet.TerminationRotationAngleAtEnd
Identifies the termination's (e.g. hook, crank) out of plane rotation angle (in radians) at the end of bar.
The default value is 0.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for terminationRotationAngleAtEnd is not finite
Since:
2027

Autodesk.Revit.DB.Structure.ComputationDataFor3DPathSet.TerminationRotationAngleAtStart
Identifies the termination's (e.g. hook, crank) out of plane rotation angle (in radians) at the start of bar.
The default value is 0.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for terminationRotationAngleAtStart is not finite
Since:
2027

Autodesk.Revit.DB.Structure.ComputationDataFor3DPathSet.TerminationOrientationAtEnd
Identifies the orientation of the termination's (e.g. hook, crank) plane at the end of the bar with respect to the orientation of the last curve and the termination plane normal.
Only two values are permitted:
Value = Right: The termination is on your right as you stand at the end of the bar, with the bar behind you, taking the termination's normal as "up."
Value = Left: The termination is on your left as you stand at the end of the bar, with the bar behind you, taking the termination's normal as "up."
The default value is Left.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2027

Autodesk.Revit.DB.Structure.ComputationDataFor3DPathSet.TerminationOrientationAtStart
Identifies the orientation of the termination's (e.g. hook, crank) plane at the start of the bar with respect to the orientation of the first curve and the termination plane normal.
Only two values are permitted:
Value = Right: The termination is on your right as you stand at the end of the bar, with the bar behind you, taking the termination's normal as "up."
Value = Left: The termination is on your left as you stand at the end of the bar, with the bar behind you, taking the termination's normal as "up."
The default value is Left.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2027

Autodesk.Revit.DB.Structure.ComputationDataFor3DPathSet
This class encapsulates data needed to compute a 3D path set.
Since:
2027